Revit 2027 API
ExtendedPropertiesLinkData.HasSchema Method
 Queries whether the schema already exists in this data.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasSchema(
	ForgeTypeId schemaId
)
Public Function HasSchema (
	schemaId As ForgeTypeId
) As Boolean
public:
bool HasSchema(
	ForgeTypeId^ schemaId
)
member HasSchema :
        schemaId : ForgeTypeId -> bool
Parameters
schemaId ForgeTypeId
 Identifier of the schema to check.
Return Value
Boolean
 True if the schema already exists in this data, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExtendedPropertiesLinkData Class
Autodesk.Revit.DB.ExternalData Namespace